
# 17
# Дан список чисел. Определите, сколько в нем встречается различных чисел.

# Input: [1, 1, 2, 0, -1, 3, 4, 4]

# Output: 6

# n = int (input ("Введите длину списка"))

x = [1, 1, 2, 0, -1, 3, 4, 4]

a = set(x)

print (a)
print (len(a))